Revit 2027 API
IFCFileFormat Enumeration
 The IFC file format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCFileFormat
Public Enumeration IFCFileFormat
public enum class IFCFileFormat
type IFCFileFormat
Members
Member name | Value | Description
Ifc | 0 |  IFC format.
IfcXML | 1 |  IFC-XML format.
IfcXMLZIP | 3 |  IFC-XML file, zipped to IFC-ZIP format.
IfcZIP | 2 |  IFC file, zipped to IFC-ZIP format.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace